In [ ]:
# import libraries
import numpy as np
import pandas as pd

In [ ]:
# import dataset
df = pd.read_csv("Student_Marks.csv")

In [ ]:
df.head(5)

   number_courses  time_study   Marks
0               3       4.508  19.202
1               4       0.096   7.734
2               4       3.133  13.811
3               6       7.909  53.018
4               8       7.811  55.299

In [ ]:
df.isna().sum()

number_courses    0
time_study        3
Marks             2
dtype: int64

In [ ]:
d1 = df.copy()

In [ ]:
d1.fillna(0)

    number_courses  time_study   Marks
0                3       4.508  19.202
1                4       0.096   7.734
2                4       3.133  13.811
3                6       7.909  53.018
4                8       7.811  55.299
..             ...         ...     ...
95               6       3.561  19.128
96               3       0.301   5.609
97               4       0.000  41.444
98               7       0.309  12.027
99               3       6.335  32.357

[100 rows x 3 columns]

In [ ]:
d2 = df.copy()
d2["time_study"].fillna(df["time_study"].mean())

0     4.508000
1     0.096000
2     3.133000
3     7.909000
4     7.811000
        ...
95    3.561000
96    0.301000
97    4.061649
98    0.309000
99    6.335000
Name: time_study, Length: 100, dtype: float64

In [ ]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   number_courses  100 non-null    int64
 1   time_study      97 non-null     float64
 2   Marks           98 non-null     float64
dtypes: float64(2), int64(1)
memory usage: 2.5 KB

In [ ]:
d2 = df.copy()
d2.dropna().info()

<class 'pandas.DataFrame'>
Index: 95 entries, 0 to 99
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   number_courses  95 non-null     int64
 1   time_study      95 non-null     float64
 2   Marks           95 non-null     float64
dtypes: float64(2), int64(1)
memory usage: 3.0 KB

In [ ]:
d3 = df.copy()
d3.interpolate(method = "linear")

    number_courses  time_study   Marks
0                3       4.508  19.202
1                4       0.096   7.734
2                4       3.133  13.811
3                6       7.909  53.018
4                8       7.811  55.299
..             ...         ...     ...
95               6       3.561  19.128
96               3       0.301   5.609
97               4       0.305  41.444
98               7       0.309  12.027
99               3       6.335  32.357

[100 rows x 3 columns]

In [ ]:
d4 = d3.interpolate(method = "linear")
d4.isna().sum()

number_courses    0
time_study        0
Marks             0
dtype: int64